robert-fun-box/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         30005;

deltaT          1;

writeControl    timeStep;

writeInterval   10000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

functions
{
//    wallHeatFluid
//    {
//        type        wallHeatFlux;
//        libs        ("libfieldFunctionObjects.so");
//        region      fluid;
//    }
//
//    wallHeatSolid
//    {
//        type        wallHeatFlux;
//        libs        ("libfieldFunctionObjects.so");
//        region      solid;
//    }
//    fieldMinMax
//    {
//        type        fieldMinMax;
//        libs        ("libfieldFunctionObjects.so");
//        write       yes;
//        log         yes;
//        location    yes;
//        mode        magnitude;
//        region      fluid;
//        fields
//        (
//            U
//            p_rgh
//        );
//    }
}


// ************************************************************************* //
