robert-fun-box/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    heat_source
    {
        type            patch;
        nFaces          364;
        startFace       48528;
    }
    solid_interface
    {
        type            mappedWall;
        nFaces          1560;
        startFace       48892;
        sampleMode      nearestPatchFaceAMI;
        sampleRegion    fluid;
        samplePatch     fluid_interface;
    }
    solid_walls
    {
        type            patch;
        nFaces          3572;
        startFace       50452;
    }
)


// ************************************************************************* //
